#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_region.Region: Reading...
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD: Refreshing state... [id=DynamoDBTableAws-4b65a10e]
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f0665d8bd08a762cc5c65ddc7eee18e6.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.72410cf711d927ef040ba3cf7de419a4.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.1ba5d290a4c38025ede7d3dddfcafb54.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d1792907b7e1112c07a9480f344d40ec.zip]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1: Refreshing state... [id=/static/js/main.f35fcf80.js.LICENSE.txt]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285: Refreshing state... [id=/static/css/main.bc8dc0a9.css]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F: Refreshing state... [id=/static/js/main.f35fcf80.js]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9: Refreshing state... [id=/static/js/main.f35fcf80.js.map]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B: Refreshing state... [id=/static/css/main.bc8dc0a9.css.map]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=zn7u6z]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 must be replaced
+/- resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      ~ created_date  = "2023-08-29T18:55:05Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:223316951128:dfh6uhtoa0/" -> (known after apply)
      ~ id            = "zn7u6z" -> (known after apply)
      ~ invoke_url    = "https://dfh6uhtoa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "78cc19573bc4e1df436a69e2fc9eeee32b7d507647fcaa16efc93b17aaa38651" -> "cdbb77477737719ee2d53bd94fac7259795a04423fd369081d68bf269968ad48"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98 will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "VotingAppApi_api_CB41EC98" {
      ~ body                         = jsonencode(
          ~ {
              ~ paths   = {
                  ~ "/leaderboard"    = {
                      ~ get = {
                          ~ responses                       = {
                              ~ "200" = {
                                  + headers     = {
                                      + Access-Control-Allow-Headers = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Methods = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Origin  = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Max-Age       = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                    }
                                    # (2 unchanged attributes hidden)
                                }
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                  ~ "/requestChoices" = {
                      ~ post = {
                          ~ responses                       = {
                              ~ "200" = {
                                  + headers     = {
                                      + Access-Control-Allow-Headers = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Methods = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Origin  = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Max-Age       = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                    }
                                    # (2 unchanged attributes hidden)
                                }
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                  ~ "/selectWinner"   = {
                      ~ post = {
                          ~ responses                       = {
                              ~ "200" = {
                                  + headers     = {
                                      + Access-Control-Allow-Headers = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Methods = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Allow-Origin  = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                      + Access-Control-Max-Age       = {
                                          + schema = {
                                              + type = "string"
                                            }
                                        }
                                    }
                                    # (2 unchanged attributes hidden)
                                }
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                  ~ "/{proxy+}"       = {
                      ~ x-amazon-apigateway-any-method = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          ~ responses                       = {
                              + "204" = {
                                  + description = "204 response"
                                  + headers     = {
                                      + Access-Control-Allow-Headers = {
                                          + type = "string"
                                        }
                                      + Access-Control-Allow-Methods = {
                                          + type = "string"
                                        }
                                      + Access-Control-Allow-Origin  = {
                                          + type = "string"
                                        }
                                      + Content-Type                 = {
                                          + type = "string"
                                        }
                                    }
                                }
                                # (1 unchanged attribute hidden)
                            }
                          ~ x-amazon-apigateway-integration = {
                              + passthroughBehavior = "never"
                              ~ requestTemplates    = {
                                  ~ "application/json" = jsonencode(
                                        {
                                          - statusCode = 404
                                        }
                                    ) -> <<-EOT
                                        #if ($context.httpMethod == "OPTIONS")
                                                            {"statusCode": 204}
                                                        #else
                                                            {"statusCode": 404}
                                                        #end
                                    EOT
                                }
                              ~ responses           = {
                                  + "204"   = {
                                      + responseParameters = {
                                          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Requested-With'"
                                          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,PUT,DELETE,HEAD,OPTIONS'"
                                          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
                                          + "method.response.header.Content-Type"                 = "'application/json'"
                                        }
                                      + responseTemplates  = {
                                          + "application/json" = jsonencode({})
                                        }
                                      + statusCode         = "204"
                                    }
                                  + "404"   = {
                                      + responseParameters = {
                                          + "method.response.header.Content-Type" = "'application/json'"
                                        }
                                      + responseTemplates  = {
                                          + "application/json" = jsonencode(
                                                {
                                                  + message    = "Error: Resource not found"
                                                  + statusCode = 404
                                                }
                                            )
                                        }
                                      + statusCode         = "404"
                                    }
                                  ~ default = {
                                      ~ responseTemplates  = {
                                          ~ "application/json" = "{\"statusCode: 404, \"message\": \"Error: Resource not found\"}" -> jsonencode(
                                                {
                                                  + message    = "Error: Resource not found"
                                                  + statusCode = 404
                                                }
                                            )
                                        }
                                        # (2 unchanged attributes hidden)
                                    }
                                }
                                # (1 unchanged attribute hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
                # (1 unchanged attribute hidden)
            }
        )
        id                           = "dfh6uhtoa0"
        name                         = "api-c8bc2868"
        tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be updated in-place
  ~ resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      ~ deployment_id         = "zn7u6z" -> (known after apply)
        id                    = "ags-dfh6uhtoa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.InitializeTable_Function_CloudwatchLogGroup_E746307D will be created
  + resource "aws_cloudwatch_log_group" "InitializeTable_Function_CloudwatchLogGroup_E746307D" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/Function-c8e7055b"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-41f14472_CloudwatchLogGroup_6240AD7B will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-41f14472_CloudwatchLogGroup_6240AD7B" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-41f14472-c87bddf9"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_CloudwatchLogGroup_B868F507 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_CloudwatchLogGroup_B868F507" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-52bc3c17-c89daf14"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_CloudwatchLogGroup_D05DD3A3 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_CloudwatchLogGroup_D05DD3A3" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519 will be updated in-place
  ~ resource "aws_iam_role_policy" "InitializeTable_Function_IamRolePolicy_2AD89519" {
        id     = "terraform-20230727202411672600000001:terraform-20230727202424567600000008"
        name   = "terraform-20230727202424567600000008"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:PutItem",
                        ] -> "none:null"
                      ~ Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E" {
        id     = "terraform-20230727204725916100000001:terraform-20230727204739773400000005"
        name   = "terraform-20230727204739773400000005"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:PutItem",
                        ] -> "none:null"
                      ~ Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9 will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9" {
        id     = "terraform-20230808003212924500000001:terraform-20230808003225755300000003"
        name   = "terraform-20230808003225755300000003"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:Scan",
                        ] -> "none:null"
                      ~ Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97 will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97" {
        id     = "terraform-20230803215115569800000002:terraform-20230803215115813700000003"
        name   = "terraform-20230803215115813700000003"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:Scan",
                        ] -> "none:null"
                      ~ Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-29T18:54:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:19/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.72410cf711d927ef040ba3cf7de419a4.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8797a07e078f844106e0b892b1897471.zip"
        tags                           = {}
      ~ timeout                        = 30 -> 60
      ~ version                        = "19" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-29T18:54:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:18/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f0665d8bd08a762cc5c65ddc7eee18e6.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.38b3ffd3a27b1fb843f68b0fceb6b8de.zip"
        tags                           = {}
      ~ timeout                        = 30 -> 60
      ~ version                        = "18" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-29T18:54:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:15/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.1ba5d290a4c38025ede7d3dddfcafb54.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.9baa24c62566a265d7dea0c54ea065b7.zip"
        tags                           = {}
      ~ timeout                        = 30 -> 60
      ~ version                        = "15" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-29T18:54:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:17/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d1792907b7e1112c07a9480f344d40ec.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.80d06e8569a8701b71c2f3be8c043eb1.zip"
        tags                           = {}
      ~ timeout                        = 30 -> 60
      ~ version                        = "17" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29 will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29 is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "cloudWebsite_Encryption_6A8A4E29" {
      - bucket = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - id     = "cloud-website-c8e58765-20230803215115368500000001" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "80b89cd8c90a6e9f0b8137adce611918" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.72410cf711d927ef040ba3cf7de419a4.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.72410cf711d927ef040ba3cf7de419a4.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8797a07e078f844106e0b892b1897471.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/72410CF711D927EF040BA3CF7DE419A4/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/8797A07E078F844106E0B892B1897471/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e6544e225d494564aafd5821f3a4f082" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f0665d8bd08a762cc5c65ddc7eee18e6.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f0665d8bd08a762cc5c65ddc7eee18e6.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.38b3ffd3a27b1fb843f68b0fceb6b8de.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/F0665D8BD08A762CC5C65DDC7EEE18E6/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/38B3FFD3A27B1FB843F68B0FCEB6B8DE/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "30c0fa5a7ffb0bcfbb5540c277cfe419" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.1ba5d290a4c38025ede7d3dddfcafb54.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.1ba5d290a4c38025ede7d3dddfcafb54.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.9baa24c62566a265d7dea0c54ea065b7.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/1BA5D290A4C38025EDE7D3DDDFCAFB54/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/9BAA24C62566A265D7DEA0C54EA065B7/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "eaa294f57978657aa1e3cc7ebe1de7ec" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d1792907b7e1112c07a9480f344d40ec.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d1792907b7e1112c07a9480f344d40ec.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.80d06e8569a8701b71c2f3be8c043eb1.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/D1792907B7E1112C07A9480F344D40EC/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/80D06E8569A8701B71C2F3BE8C043EB1/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 10 to change, 6 to destroy.

Changes to Outputs:
  - WING_TEST_RUNNER_FUNCTION_ARNS        = jsonencode([])
  + WING_TEST_RUNNER_FUNCTION_IDENTIFIERS = jsonencode([])

```

</details>
